
<?php

//Задание 1
echo "<br><br>Задание 1 <br>";

$i = 0;
while ($i <= 100) {
    if ($i % 3 == 0 && $i > 0) {
        echo "$i ";
        $i++;
    }
    else {
        $i++;
    }
}

// Задание 2
echo "<br><br>Задание 2 <br>";

function oddEven($num) {
    if ($num == 0) {
        return "$num - это ноль";
    }
    elseif ($num % 2 == 0) {
        return "$num - четное число";
    }
    else {
        return "$num - нечетное число";
    }
}

$n = 0;
do {
    echo oddEven($n) . "<br>";
    $n++;
} while ($n <= 10);

// Задание 3
echo "<br><br>Задание 3 <br>";

$area = [
    "Московская область" => [
    "town" => ["Москва", "Зеленоград", "Клин", "Королев"]
        ],
    "Ленинградская область" => [
    "town" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"]
        ],
    "Волгоградская область" => [
    "town" => ["Волгоград", "Волжский", "Камышин", "Калач-на-Дону"]
        ]
];

foreach($area as $region => $gorod) {
    $goroda = implode(", ", $gorod['town']);
    echo "<br>$region: <br> города: $goroda";
}

// Задание 4
echo "<br><br>Задание 4 <br>"; 

function translit($stroka){
    $abc = [
    "а" => "а",
    "б" => "b",
    "в" => "v",
    "г" => "g",
    "д" => "d",
    "е" => "e",
    "ё" => "yo",
    "ж" => "zh",
    "з" => "z",
    "и" => "i",
    "к" => "k",
    "л" => "l",
    "м" => "m",
    "н" => "n",
    "о" => "o",
    "п" => "p",
    "р" => "r",
    "с" => "s",
    "т" => "t",
    "у" => "u",
    "ф" => "f",
    "х" => "kh",
    "ц" => "ts",
    "ч" => "ch",
    "ш" => "sh",
    "щ" => "shch",
    "ъ" => "'",
    "ы" => "y",
    "ь" => "'",
    "э" => "e",
    "ю" => "yu",
    "я" => "ya",
    "А" => "A",
    "Б" => "B",
    "В" => "V",
    "Г" => "G",
    "Д" => "D",
    "Е" => "E",
    "Ё" => "Yo",
    "Ж" => "Zh",
    "З" => "Z",
    "И" => "I",
    "К" => "K",
    "Л" => "L",
    "М" => "M",
    "Н" => "N",
    "О" => "O",
    "П" => "P",
    "Р" => "R",
    "С" => "S",
    "Т" => "T",
    "У" => "U",
    "Ф" => "F",
    "Х" => "Kh",
    "Ц" => "Ts",
    "Ч" => "Ch",
    "Ш" => "Sh",
    "Щ" => "Shch",
    "Ы" => "Y",
    "Э" => "E",
    "Ю" => "Yu",
    "Я" => "Ya"
];
    $stroka = strtr($stroka, $abc);
    return $stroka;
}

$stroka = "Привет! Как твои дела, Вася?<br> Эээ, брат, вещь!<br> ЭЮЯ ЭЮЯ здесь получается ПеСтНя";

echo translit($stroka);

